app/views/slides/show.html.erb

SELECT  `slides`.* FROM `slides`  WHERE (id > 1)  ORDER BY id DESC LIMIT 1
---
					<!-- Controls -->
					  <% if @slide.id == Slide.last.id %>

SELECT  `slides`.* FROM `slides`   ORDER BY `slides`.`id` ASC LIMIT 1
---

					  <% if @slide.id == Slide.first.id %>